задачник_едт/src/Documents/Проект/Проект.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Проект</name>
  <comment>Проектные работы</comment>
  <posting>Deny</posting>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПроекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

задачник_едт/src/AccumulationRegisters/Себестоимость/Себестоимость.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Себестоимость</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>ПлановаяСтоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Себестоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДополнительныеРасходы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>DocumentRef.Проект</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Этап</name>
    <type>
      <types>DocumentRef.ЭтапПроекта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяЗатрат</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидЗатрат</name>
    <type>
      <types>EnumRef.ВидыЗатрат</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

задачник_едт/src/Documents/Проект/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура УстановитьОтборСпискаЭтапов()
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(СписокЭтапов.Отбор, "Проект", Объект.Ссылка); 
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборСписокаЗадач(ВыбранныйЭтап)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(СписокЗадачЭтапа.Отбор, "ЭтапПроекта", ВыбранныйЭтап);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЭтаповПриАктивизацииСтроки(Элемент)
	ВыбранныйЭтап = Неопределено;
	Если ЗначениеЗаполнено(Объект.Ссылка) И Элемент.ТекущиеДанные <> Неопределено Тогда
		ВыбранныйЭтап = Элемент.ТекущиеДанные.Ссылка;
	КонецЕсли;
	УстановитьОтборСписокаЗадач(ВыбранныйЭтап);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	УстановитьОтборСпискаЭтапов();
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьОтборСпискаЭтапов();
	УстановитьСумму();
КонецПроцедуры

&НаКлиенте
Процедура СписокЭтаповПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Перед добавлением строки документ необходимо записать.'")); 
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЗадачЭтапаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Перед добавлением строки документ необходимо записать.'")); 
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСумму()
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СебестоимостьОбороты.ПлановаяСтоимостьОборот
		|ИЗ
		|	РегистрНакопления.Себестоимость.Обороты КАК СебестоимостьОбороты
		|ГДЕ
		|	СебестоимостьОбороты.Проект = &Проект";
	
	Запрос.УстановитьПараметр("Проект", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Объект.Сумма = ВыборкаДетальныеЗаписи.ПлановаяСтоимостьОборот;
	Иначе
		Объект.Сумма = 0;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ЗаписанЭтапПроекта" И Объект.Ссылка = Параметр Тогда 
		УстановитьСумму();
	КонецЕсли;
	
КонецПроцедуры
